In [14]:
import numpy as np
import pandas as pd

In [16]:
df =pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [19]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [20]:
target = df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [21]:
inputs = df.drop(['Survived'],axis=1)
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [23]:
dummies = pd.get_dummies(df['Sex'])

In [25]:
inputs = pd.concat([inputs,dummies],axis=1)

In [26]:
inputs.drop(['Sex'],axis=1, inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [29]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [37]:
inputs['Age'] = inputs['Age'].fillna(inputs['Age'].mean())

In [39]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [33]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [40]:
from sklearn.model_selection import train_test_split

In [49]:
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [42]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [50]:
model.fit(X_train, y_train)
model.score(X_test, y_test)

0.7877094972067039

In [51]:
model.predict_proba(X_test[:10])

array([[0.92918419, 0.07081581],
       [0.9888694 , 0.0111306 ],
       [0.04768398, 0.95231602],
       [0.98929882, 0.01070118],
       [0.98113656, 0.01886344],
       [0.02303959, 0.97696041],
       [0.00152802, 0.99847198],
       [0.02863008, 0.97136992],
       [0.98947912, 0.01052088],
       [0.92741124, 0.07258876]])